#შექმენით ერთი სია რომელშიც შეიტანთ სახელებს შემდეგ შექმენით მეორე სია რომელშიც იქნება ისევ სხვადასხვა 
#სახელები გააერთიანეთ ეს ორი სია ჩაამატეთ 5 ინდექსზე ახალი სახელი დაითვალეთ გაერთიანებული 
#სიის სიგრძე და დაითვალეთ თქვენი სახელი რამდენჯერ გვხვდება ამ სიაში, ასევე დაბეჭდეთ რომელ ინდექსზე დგას თქვენი სახელი
name1 = ["ნიკა", "გიორგი", "დავით", "ლევან"]


name2 = ["ანა", "მარიამი", "თამარი", "გიორგი"]



name1.extend(name2)

name1.insert(5, "კახი")


list_length = len(name1)

giorgi = name1.count("გიორგი")
giorgi1= name1.index("გიორგი")
print(name1)
print(giorgi1)
print(giorgi)
print(list_length)

