#შექმენით პროგრამა რომელიც გამოითვლის ჯგუფის საშუალო ასაკს. 
#ასევე გამოითვალეთ ყველაზე ხშირად რომელი ასაკი გვხვდება

age = [15, 15, 16, 16, 16, 16, 16, 16, 15, 17, 17, 17, 17, 19, 21, 21, 23, 25, 25, 26, 32]



average_age = sum(age) / len(age)
print(average_age)

#2)  შექმენით პროგრამა რომელიც დაითვლის სიაში რამდენჯერ მეორდება თქვენი სახელი არ გამოიყენოთ count ფუნქცია 

names = ["დავითი", "მარიამი", "გიორგი", "დავითი", "ნინო", "მარიამი", "დავითი"]

target_name = "დავითი"

name_count = 0

for name in names:
    if name == target_name:
        name_count += 1

print(f"სახელი '{target_name}' გამოჩნდა {name_count} ჯერ.")

#3)  შექმენით პროგრამა რომელიც დაითვლის სიაში რამდენჯერ მეორდება თქვენი სახელი გამოიყენეთ count ფუნქცია

names_list = ['მარიამ', 'გიორგი', 'დავით', 'მარიამ', 'ნიკა', 'მარიამ']


my_name = 'მარიამ'


name_count = names_list.count(my_name)


print(f"სახელი '{my_name}' გვხვდება სიაში {name_count} ჯერ.")


